nc: 5
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # ↓↓↓ 只把 Conv 替换为 RepConv ↓↓↓
  - [-1, 1, RepConv, [64, 3, 2]]      # Conv1
  - [-1, 1, RepConv, [128, 3, 2]]     # Conv2
  - [-1, 3, C2f, [128]]               # C2f1
  - [-1, 1, RepConv, [256, 3, 2]]     # Conv3
  - [-1, 6, C2f, [256]]               # C2f2
  - [-1, 1, RepConv, [512, 3, 2]]     # Conv4
  - [-1, 6, C2f, [512]]               # C2f3
  - [-1, 1, RepConv, [1024, 3, 2]]    # Conv5
  - [-1, 3, C2f, [1024]]              # C2f4
  - [-1, 1, SPPF, [1024, 5]]          # SPPF


head:
  [
    [-1, 1, GSConv, [256, 1, 1]],                  # 10 ← 改
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 11
    [[-1, 6], 1, Concat, [1]],                     # 12
    [-1, 3, C2f, [256]],                           # 13

    [-1, 1, GSConv, [128, 1, 1]],                  # 14 ← 改
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 15
    [[-1, 4], 1, Concat, [1]],                     # 16
    [-1, 3, C2f, [128]],                           # 17

    [-1, 1, GSConv, [128, 3, 2]],                  # 18 ← 改
    [[-1, 14], 1, Concat, [1]],                    # 19
    [-1, 3, C2f, [256]],                           # 20

    [-1, 1, GSConv, [256, 3, 2]],                  # 21 ← 改
    [[-1, 10], 1, Concat, [1]],                    # 22
    [-1, 3, C2f, [512]],                           # 23

    [[17, 20, 23], 1, Detect, [nc]]               # 24 output
  ]