# YOLOv8n with GhostConv in backbone only (C2f + Head remain unchanged)
# Class count: nc = 5  (chair, bird, cat, sheep, cattle)

nc: 5
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # ↓↓↓ 只把 Conv 替换为 GhostConv ↓↓↓
  - [-1, 1, GhostConv, [64, 3, 2]]      # Conv1
  - [-1, 1, GhostConv, [128, 3, 2]]     # Conv2
  - [-1, 3, C2f, [128]]        # C2f1
  - [-1, 1, GhostConv, [256, 3, 2]]     # Conv3
  - [-1, 6, C2f, [256]]                 # C2f2
  - [-1, 1, GhostConv, [512, 3, 2]]     # Conv4
  - [-1, 6, C2f, [512]]                 # C2f3
  - [-1, 1, GhostConv, [1024, 3, 2]]    # Conv5
  - [-1, 3, C2f, [1024]]                # C2f4
  - [-1, 1, SPPF, [1024, 5]]            # SPPF

head:
  # ↓↓↓ Head结构保持原 YOLOv8n 的默认 ↓↓↓
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[17, 20, 23], 1, Detect, [nc]]
