# YOLOv8n backbone replaced with GhostConv + GhostC2f, head unchanged
# Number of classes
nc: 5

# Scaling factors
depth_multiple: 0.33
width_multiple: 0.25

# ─────────── BACKBONE ───────────
backbone:
  # [from, number, module, args]
  - [-1, 1, GhostConv, [64, 3, 2]]
  - [-1, 1, GhostConv, [128, 3, 2]]
  - [-1, 3, GhostC2f, [128]]
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [-1, 3, GhostC2f, [256]]
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [-1, 3, GhostC2f, [512]]
  - [-1, 1, GhostConv, [1024, 3, 2]]
  - [-1, 3, GhostC2f, [1024]]
  - [-1, 1, SPPF, [1024, 5]]

# ─────────── HEAD ───────────
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  # Detect([P3, P4, P5])
  - [[17, 20, 23], 1, Detect, [nc]]

