# YOLOv8n baseline model config (adapted from official)
# Only "nc" 是你需要根据数据集改动的，其他保持原版

# 1️⃣ 数据集类别数（你当前是五类动物）
nc: 5

# 2️⃣ 模型缩放比例（决定网络深度和宽度）
depth_multiple: 0.33  # 模型深度缩放系数
width_multiple: 0.25  # 模型宽度缩放系数

# 3️⃣ 主干网络（Backbone）
backbone:
  [
    [-1, 1, Conv, [64, 3, 2]],      # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
    [-1, 3, C2f, [128, True]],      # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
    [-1, 6, C2f, [256, True]],      # 4
    [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
    [-1, 6, C2f, [512, True]],      # 6
    [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32
    [-1, 3, C2f, [1024, True]],     # 8
    [-1, 1, SPPF, [1024, 5]],       # 9
  ]

# 4️⃣ 头部结构（Head）
head:
  [
    [-1, 1, Conv, [256, 1, 1]],                  # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
    [[-1, 6], 1, Concat, [1]],                   # 12
    [-1, 3, C2f, [256]],                         # 13

    [-1, 1, Conv, [128, 1, 1]],                  # 14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 4], 1, Concat, [1]],                   # 16
    [-1, 3, C2f, [128]],                         # 17

    [-1, 1, Conv, [128, 3, 2]],                  # 18
    [[-1, 14], 1, Concat, [1]],                  # 19
    [-1, 3, C2f, [256]],                         # 20

    [-1, 1, Conv, [256, 3, 2]],                  # 21
    [[-1, 10], 1, Concat, [1]],                  # 22
    [-1, 3, C2f, [512]],                         # 23

    [[17, 20, 23], 1, Detect, [nc]]              # 24 output layers
  ]
